use small_clinic;


INSERT INTO users (name, post, proxy) values
('Лероева Юлия Андреевна', 'Администратор', '№ 2 от 30.11.2017'),
('Смолянинова Юнона Геннадиевна', 'Администратор', '№ 3 от 10.02.8018'),
('Немцева Виктория Никитевна', 'Администратор', '№ 4 от 25.05.2017'),
('Справцева Вероника Захаровна', 'Начальник отделения', '№ 1 от 25.08.2017');


INSERT INTO patients (name,discounts) values
('Вельяминов Эдуард Денисович', 10),
('Саврасов Семен Валерьянович', 0),
('Сиянов Феликс Пахомович', 0),
('Гайдук Анатолий Иннокентиевич', 0),
('Орел Аким Анатолиевич', 0),
('Елизарова Христина Юрьевна', 10),
('Авдиенко Розалия Захаровна', 0),
('Бранта Ирина Евгениевна', 0),
('Ярмоненко Ариадна Чеславовна', 0),
('Полторака Ираида Родионовна', 0),
('Николин Игнат Пахомович', 0),
('Вергун Аскольд Прохорович', 0),
('Доронин Евграф Вадимович', 0),
('Домышев Степан Натанович', 0),
('Александрович Виктория Адамовна', 0),
('Нутрихина Эмилия Радионовна', 0),
('Крылаева Ариадна Максимовна', 0),
('Яхина Римма Алексеевна', 0),
('Бобр Чеслав Давыдович', 0),
('Коновалова Ярослава Харитоновна', 0);


INSERT INTO patients_under_18 (patient_id, gender, birthday, address, nationality) values
(3, 'm', '2008-02-14', 'Москва, проезд Берёзовой рощи, д. 5', 'rus'),
(4, 'm', '2015-03-20', 'Москва, проезд Берёзовой рощи, д. 2', 'rus'),
(5, 'm', '2014-05-24', 'Москва, ул. Красноармейская, д. 30А', 'rus'),
(6, 'm', '2015-08-01', 'Москва, Ленинградское шоссе, 46', 'rus'),
(7, 'f', '1988-02-05', 'Москва, ул. Правды, 21, стр. 1', 'rus'),
(8, 'f', '2010-02-14', 'Москва, проезд Берёзовой рощи, д. 5', 'rus'),
(9, 'f', '2013-09-18', 'Москва, ул. Красноармейская, д. 34', 'rus'),
(10, 'f', '2014-04-13', 'Москва, ул. Правды, 2, стр. 1', 'rus'),
(11, 'f', '2010-12-23', 'Москва, ул. Долгоруковская, 401', 'rus'),
(12, 'm', '2015-11-02', 'Москва, проезд Берёзовой рощи, д. 6', 'blr'),
(13, 'm', '2014-02-28', 'Москва, Ленинградское шоссе, 4', 'rus'),
(14, 'm', '2010-12-05', 'Москва, ул. Красноармейская, д. 35А', 'rus'),
(15, 'm', '2015-02-14', 'Москва, проезд Берёзовой рощи, д. 24', 'rus'),
(16, 'm', '2010-10-16', 'Москва, Ленинградское шоссе, 48', 'blr'),
(17, 'f', '2014-10-17', 'Москва, проезд Берёзовой рощи, д. 24', 'rus'),
(18, 'f', '2014-05-30', 'Москва, ул. 2-я Фрунзенская, 10', 'rus');


INSERT INTO representatives (representative_id, name, gender, birthday, address, nationality, passport, phone, e_mail) values
(3, 'Сиянова Инга Феодосьевна', 'f', '1986-02-14', 'Москва, проезд Берёзовой рощи, д. 5', 'rus', '№2547 255236 Выдан ОУФМС........', 79265223225, 'arlo50@example.org'),
(4, 'Гайдук Влада Архиповна', 'f', '1986-03-20', 'Москва, проезд Берёзовой рощи, д. 2', 'rus', '№1236 565236 Выдан ОУФМС........', 792658963211, 'arlo80@example.org'),
(5, 'Орел Дина Самуиловна', 'f', '1985-05-24', 'Москва, ул. Красноармейская, д. 30А', 'rus', '№2367 565236 Выдан ОУФМС........', 792658663225, 'mmarvin@example.com'),
(6, 'Елизарова Розалия Макаровна', 'f', '1987-08-01', 'Москва, Ленинградское шоссе, 46', 'rus', '№2525 565236 Выдан ОУФМС........', 792658933325, 'mmvin@example.com'),
(7, 'Авдиенко Розалия Захаровна', 'f', '1969-02-05', 'Москва, ул. Правды, 21, стр. 1', 'rus', '№1117 565236 Выдан ОУФМС........', 792658883225, 'mmarvin21@example.com'),
(8, 'Бранта Изабелла Ростиславовна', 'f', '1985-02-14', 'Москва, проезд Берёзовой рощи, д. 5', 'rus', '№2557 565236 Выдан ОУФМС........', 792658962525, 'mmarvin3@example.com'),
(9, 'Ярмоненко Альбина Соломоновна', 'f', '1975-09-18', 'Москва, ул. Красноармейская, д. 34', 'rus', '№1237 565236 Выдан ОУФМС........', 79265873225, 'mmarvin20@example.com'),
(10, 'Полторака Алиса Ульяновна', 'f', '1974-04-13', 'Москва, ул. Правды, 2, стр. 1', 'rus', '№2253 565236 Выдан ОУФМС........', 7926589632885, 'mmarvin67@example.com'),
(11, 'Николин Дина Самуиловна', 'f', '1976-12-23', 'Москва, ул. Долгоруковская, 401', 'rus', '№3697 565236 Выдан ОУФМС........', 792658922225, 'mmn@example.com'),
(12, 'Вергун Ульяна Никоновна', 'f', '1985-11-02', 'Москва, проезд Берёзовой рощи, д. 6', 'blr', '№2547 565236 Выдан............', 792658963775,'arlo600@example.org'),
(13, 'Доронина Елизавета Михаиловна', 'f', '1968-02-28', 'Москва, Ленинградское шоссе, 4', 'rus', '№7524 565236 Выдан ОУФМС........', 792658773225, 'arvin@example.com'),
(14, 'Домышева  Берта Измаиловна', 'f', '1969-12-05', 'Москва, ул. Красноармейская, д. 35А', 'rus', '№2247 565236 Выдан ОУФМС........', 7926999963225, '0a2rvin@example.com'),
(15, 'Александрович Изольда Анатолиевна', 'f', '1974-02-14', 'Москва, проезд Берёзовой рощи, д. 24', 'rus', '№2587 115236 Выдан ОУФМС........', 792658963220, '30arvin@example.com'),
(16, 'Нутрихина Надежда Лаврентиевна','f', '1985-10-16', 'Москва, Ленинградское шоссе, 48', 'blr', '№2547 565236 Выдан .............', 792658963275, 'arbo50@example.org'),
(17, 'Крылаев Степан Натанович','f', '1986-10-17', 'Москва, проезд Берёзовой рощи, д. 24', 'rus', '№2547 114436 Выдан ОУФМС........', 792658963280, 'mmarviren@example.com'),
(18, 'Яхина Аким Анатолиевич','m', '1980-05-30', 'Москва, ул. 2-я Фрунзенская, 10', 'rus', '№2257 565836 Выдан ОУФМС........', 792658963200, 'mmarvin777@example.com');


INSERT INTO patients_upper_18 (patient_id, gender, birthday, address, nationality, passport, phone, e_mail) values
(1, 'm', '1988-02-14', 'Москва, ул. Правды, 21, стр. 1', 'rus', '№2547 565236 Выдан ОУФМС........', 79263586525, 'edach@example.com'),
(2,'m','1985-10-15', 'Москва, Ходынский б-р, 4', 'rus', '№2585 562545 Выдан ОУФМС........', 792658963225, 'mona94@example.com'),
(19, 'f', '1992-08-29', 'Москва, Ходынский б-р, 44', 'rus', '№2585 587545 Выдан ОУФМС........', 792621473225, 'pleffler@example.org'),
(20, 'f', '1984-11-12','Москва, Московский б-р, 4', 'rus', '№2585 985245 Выдан ОУФМС........', 792621471212,  'pleffler@mail.org');

INSERT INTO templates (name, contain) values
('Договор с пациентом', 'Тут должно быть очень много текста'),
('Договор с законным представителем пациента', 'Тут должно быть очень много текста'),
('Согласие на обработку персональных данных. Пациент', 'Тут должно быть очень много текста'),
('Согласие на обработку персональных данных. Законный представитель', 'Тут должно быть очень много текста');

INSERT INTO documents (numbers, documents_id, patient_id, signature_from_clinik) values
(00001, 1, 1, 1),
(00002, 3, 1, 1),
(00003, 1, 2, 3),
(00004, 3, 2, 3),
(00005, 2, 3, 3),
(00006, 4, 3, 3),
(00007, 2, 4, 1),
(00008, 4, 4, 1),
(00009, 2, 5, 1),
(00010, 4, 5, 1),
(00011, 2, 6, 1),
(00012, 4, 6, 3),
(00013, 2, 7, 3),
(00014, 4, 7, 3),
(00015, 2, 8, 3),
(00016, 4, 8, 3),
(00017, 2, 9, 2),
(00018, 4, 9, 2),
(00019, 2, 10, 3),
(00020, 4, 10, 3),
(00021, 2, 11, 3),
(00022, 4, 11, 3),
(00023, 2, 12, 3),
(00024, 4, 12, 2),
(00025, 2, 13, 2),
(00026, 4, 13, 2),
(00027, 2, 14, 2),
(00028, 4, 14, 2),
(00029, 2, 15, 2),
(00030, 4, 15, 2),
(00031, 2, 16, 2),
(00032, 4, 16, 2),
(00033, 2, 17, 1),
(00034, 4, 17, 1),
(00035, 2, 18, 1),
(00036, 4, 18, 1),
(00037, 1, 19, 3),
(00038, 3, 19, 3),
(00039, 1, 20, 3),
(00039, 3, 20, 3);



INSERT INTO doctors (name, specialization, academic_degree) values
('Русских Евстигней Яковович', 'врач-педиатр', 'к.м.н.'),
('Копылов Вадим Даниилович', 'врач-педиатр', 'нет'),
('Максимушкин Игнатий Прохорович', 'врач-педиатр', 'нет'),
('Яскин Антон Феликсович', 'врач-педиатр', 'нет'),
('Серыха Марта Ипполитовна', 'врач-педиатр', 'нет'),
('Сахаровский Терентий Измаилович', 'врач-оториноларинголог', 'к.м.н.'),
('Астанкова Христина Андриановна', 'врач-оториноларинголог', 'нет'),
('Юматова Жанна Зиновьевна', 'врач-кардиолог', 'нет'),
('Витаева Лидия Марковна', 'врач-гастроэнтеролог', 'к.м.н.'),
('Кулигин Агап Мирославович', 'врач травматолог-ортопед', 'д.м.н.'),
('Кузькина Вероника Михеевна', 'врач-невролог', 'нет'),
('Абрамова Злата Леонидовна', 'врач-офтальмолог', 'нет'),
('Лягушова Клара Гаврииловна', 'врач-эндокринолог', 'нет');



INSERT INTO nurses (name, specialization) values
('Сиянскиха Таисия Елисеевна', 'cтаршая медицинская сестра'),
('Позона Клара Константиновна', 'процедурная медицинская сестра'),
('Цедлица Диана Данилевна', 'процедурная медицинская сестра'),
('Кобыльских Ирина Матвеевна', 'процедурная медицинская сестра'),
('Усачёва Анастасия Платоновна', 'фельдшер-лаборант'),
('Сухих Милена Евдокимовна', 'фельдшер-лаборант');


INSERT INTO main_price (code, name, price, payment_doc, payment_nur) values
(1010, 'Прием (осмотр, консультация) врача-педиатра первичный', 1300.00, 455.00, 0),
(1008, 'Прием (осмотр, консультация) врача-оториноларинголога первичный', 1300.00, 455.00, 0),
(1004, 'Прием (осмотр, консультация) врача-детского кардиолога первичный', 1300.00, 455.00, 0),
(1003, 'Прием (осмотр, консультация) врача-гастроэнтеролога первичный', 1500.00, 525.00, 0),
(1016, 'Прием (осмотр, консультация) врача – ортопеда первичный (д.м.н.)', 3000.00, 1050.00, 0),
(1007, 'Прием (осмотр, консультация) врача- невролога первичный', 1300.00, 455.00, 0),
(1009, 'Прием (осмотр, консультация) врача-офтальмолога первичный', 1300.00, 455.00, 0),
(1020, 'Прием (осмотр, консультация) врача-детского эндокринолога первичный', 1300.00, 455.00, 0),
(1040, 'Вакцинация Пентаксим (включая осмотр врача-педиатра)', 4990.00, 469.06, 166),
(1042, 'Вакцинация Менактра (включая осмотр врача-педиатра)', 7400.00, 695.06, 222),
(1643, 'Общий массаж ребенку до года', 1200.00, 0, 420),
(1644, 'Общий массаж ребенку от 1 года до 3-х лет', 1400.00, 0, 490),
(1645, 'Общий массаж ребенку от 3-х лет до 10 лет', 1600.00, 0, 560);


INSERT INTO extra_price (code, name, price, payment) values
(060205, 'Свободный тестостерон', 1020.00, 495.00),
(060303, 'Т3 свободный', 450.00,  210.30),
(060304, 'Т4 свободный', 450.00,  210.30),
(060401, 'Кортизол', 510.00, 255.00),
(060503, 'Соматомедин - С', 1420.00,  700.50),
(060601, 'Инсулин*', 630.00,  305.00),
(060701, 'Антитела к тиреоглобулину', 540.00,  260.00),
(060712, 'Антитела к трансглутаминазе IgА', 930.00, 460.00),
(060713, 'Антитела к трансглутаминазе IgG', 930.00, 460.00),
(060714, 'Антитела к b-клеткам поджелудочной железы', 1270.00,  660.00),
(060715, 'Антитела к инсулину', 940.00, 465.00);


INSERT INTO main_service (main_service_id, patient_id, discount, price, total_price, payment_method, user_id, doctor_id, nurse_id, created_at) values
(1, 20, 0, 1300, 1300, 'card', 2, 1, null, '2019-08-1 10:50:29'),
(1, 19, 0, 1300, 1300, 'cash', 2, 2, null, '2019-08-1 11:50:29'),
(1, 19, 0, 1300, 1300, 'card', 3, 3, null, '2019-08-2 10:20:29'),
(2, 18, 0, 1300, 1300, 'card', 3, 6, null, '2019-08-2 15:50:29'),
(2, 15, 0, 1300, 1300, 'card', 3 , 7,null, '2019-08-2 17:50:29'),
(3, 14, 0, 1300, 1300, 'cash' , 1, 8, null, '2019-08-3 10:00:29'),
(2, 10, 0, 1500, 1500, 'cash', 2, 6, null, '2019-08-3 10:50:00'),
(4, 5, 0, 1500, 1500, 'cash', 1, 9, null, '2019-08-3 15:50:29'),
(4, 19, 0, 1500, 1500, 'cash', 2, 9, null, '2019-08-3 17:50:29'),
(5, 15, 0, 3000, 3000, 'cash', 1, 10, null, '2019-08-4 10:00:29'),
(5, 14, 0, 3000, 3000, 'card', 2, 10, null, '2019-08-4 10:50:00'),
(6, 13, 0, 1300, 1300, 'card', 2, 11, null, '2019-08-4 11:50:29'),
(7, 12, 0, 1300, 1300, 'card', 2, 12, null, '2019-08-5 10:40:09'),
(7, 11, 10, 1300, 1170, 'card', 1, 12, null, '2019-08-5 12:50:29'),
(1, 10, 0, 1300, 1300, 'cash', 1, 1, null, '2019-08-6 12:50:29'),
(8, 10, 0, 1300, 1300, 'cash', 1, 13, null, '2019-08-6 17:50:29'),
(9, 9, 0, 4990, 4990, 'card', 3, 4, 2,  '2019-08-7 10:50:09'),
(9, 9, 0, 4990, 4990, 'card', 3, 5, 3, '2019-08-7 11:50:09'),
(10, 9, 0, 7400, 7400, 'cash', 1, 1, 4, '2019-08-7 12:50:29'),
(10, 8, 0, 7400, 7400, 'cash', 2, 2, 1, '2019-08-8 10:50:29' ),
(11, 8, 0, 1200, 1200, 'card', 2, null, 6, '2019-08-8 11:50:29'),
(11, 7, 0, 1200, 1200, 'card', 2, null, 5, '2019-08-8 13:50:29'),
(12, 6, 10, 1400, 1260, 'cash', 1, null, 4, '2019-08-8 15:50:29'),
(13, 5, 0, 1600, 1600, 'cash', 2,  null, 3, '2019-08-9 10:50:29'),
(13, 5, 0, 1600, 1600, 'card', 2, null, 2, '2019-08-10 10:50:00'),
(13, 4, 0, 1600, 1600, 'card', 1,  null, 1, '2019-08-10 12:50:00'),
(10, 3, 0, 7400, 7400,'card' , 1, 3, 5, '2019-08-11 10:50:00'),
(5, 3, 0, 3000, 3000, 'card' , 1, 10, null, '2019-08-11 12:50:29'),
(1, 2, 0, 1300, 1300,'card', 3, 1, null, '2019-08-11 17:50:09'),
(1, 2, 0, 1300, 1300, 'cash', 3, 2, null, '2019-08-12 11:50:29'),
(1, 1, 10, 1300, 1170, 'cash', 3, 3, null, '2019-08-12 15:50:29');


INSERT INTO main_service (main_service_id, patient_id, discount, price, total_price, payment_method, user_id, doctor_id, nurse_id, created_at) values
(1, 20, 0, 1300, 1300, 'card', 2, 1, null, '2019-08-24 10:50:29'),
(1, 19, 0, 1300, 1300, 'cash', 2, 2, null, '2019-08-24 11:50:29'),
(1, 1, 10, 1300, 1170, 'cash', 3, 3, null, '2019-08-26 15:50:29');


INSERT INTO extra_service (extra_service_id, patient_id, discount, price, total_price, payment_method, user_id,  created_at) values
(1, 20, 0, 1020, 1020, 'card', 1,  '2019-08-1 09:50:29'),
(11, 7, 0, 940, 940, 'cash', 2,  '2019-08-2 11:50:29'),
(11, 8, 0, 940, 940, 'card', 1, '2019-08-3 10:20:29'),
(2, 8, 0, 450, 450, 'card', 3,  '2019-08-4 15:50:29'),
(2, 9, 0, 450, 450, 'card', 3 ,  '2019-08-5 17:50:29'),
(3, 14, 0, 450, 450, 'cash' , 1,  '2019-08-6 10:02:29'),
(2, 10, 0, 450, 450, 'cash', 2,  '2019-08-7 10:50:00'),
(8, 4, 0, 930, 930, 'cash', 1,  '2019-08-8 10:50:00'),
(9, 5, 0, 930, 930, 'cash', 1,  '2019-08-9 15:50:29'),
(4, 19, 0, 510, 510, 'cash', 2,  '2019-08-10 17:12:29'),
(10, 15, 0, 1270, 1270, 'cash', 1,  '2019-08-11 10:00:29'),
(5, 14, 0, 1420, 1420, 'card', 1,  '2019-08-12 10:13:00'),
(6, 3, 0, 630, 630, 'card', 2,  '2019-08-13 11:50:29'),
(7, 12, 0, 540, 540, 'card', 2,  '2019-08-14 10:55:09'),
(7, 11, 10, 540, 486, 'card', 1,  '2019-08-15 12:02:29');